Repository: george-nguyen-tokoin/t-chain-payment-sdk
Catalog: lib/l10n/intl_*.arb
Languages: id

source: Invalid code
id: Kode tidak valid

source: Something went wrong, please try later
id: Ada sesuatu yang tidak beres, silakan coba lagi nanti

# you_are_not_enough_bnb
source: You do not have enough BNB to perform this transaction
id: BNB Anda tidak cukup untuk mengirim transaksi

# the_selected_wallet_supports_eth_network_please_select_another_one
source: The selected wallet supports ETH network only, please select a wallet supporting BNB Smart Chain network to use the feature.
id: Dompet yang dipilih hanya mendukung jaringan ETH, silakan pilih dompet yang mendukung jaringan BNB Smart Chain untuk menggunakan fitur ini.

source: Done
id: Selesai

source: Retry
id: Coba Kembali

source: Cancel
id: Batalkan

# btn_continue
source: Continue
id: Lanjutkan

source: Blocks
id: Blok

source: Confirm
id: Konfirmasi

source: You Will Pay
id: Kamu Akan Membayar

source: Payment confirmation
id: Konfirmasi pembayaran

# select_coin_type_to_pay
source: Select a coin type that you'd like to pay
id: Pilih tipe koin yang ingin Anda bayar

source: Payment Status
id: Status Pembayaran

source: Payment Amount
id: Jumlah Pembayaran

source: Deposit Amount
id: Jumlah Deposit

source: Deposit Confirmation
id: Konfirmasi Deposit

# select_coin_type_to_deposit
source: Select a coin type that you'd like to deposit
id: Pilih tipe koin yang ingin Anda depositkan

source: Balance
id: Saldo

source: Coin Type
id: Tipe Koin

source: Select Coin Type
id: Pilih Tipe Koin

# your_balance_is_not_enough
source: Your balance is not enough {x} to make the payment
id: Saldo Anda tidak cukup {x} untuk melakukan pembayaran

source: and
id: dan

source: Transaction Fee
id: Biaya Transaksi

source: Pay TOKO Amount
id: Jumlah Toko yang Dibayar

source: Service Fee
id: Biaya Layanan

source: ({x}% discount applied)
id: (Diskon {x}% digunakan)

# use_toko_pay
source: Pay
id: Bayar

# use_toko_to_get
source: to get
id: untuk mendapatkan

# use_toko_of_service_fee
source: of the service fee (Balance:
id: dari biaya layanan (Saldo:

source: discount
id: diskon

source: Unable to Apply Discount
id: Tidak Dapat Menggunakan Diskon

# unable_to_apply_discount_desc
source: You don't have enough TOKO (available TOKO: {x}) to get {y}% discount of the service fee. Please deposit more TOKO to your balance first and proceed the payment again.
id: Kamu tidak punya cukup TOKO (TOKO yang tersedia: {x}) untuk mendapatkan diskon {y}% dari biaya layanan. Silakan depositkan lebih banyak TOKO ke saldo Anda terlebih dahulu dan proses pembayaran kembali.

source: Deposit Payment Status
id: Status Pembayaran Deposit

source: Payment Proceeding
id: Pembayaran Diproses

# payment_proceeding_brought_back_3rdapp
source: Your payment is proceeding, you will be brought back to [3rd party app name] in {x} seconds
id: Pembayaran Anda sedang diproses, Anda akan dibawa kembali ke [nama aplikasi pihak ketiga] dalam {x} detik

# payment_proceeding_can_take_up
source: Your payment is proceeding, it can take up to {x} seconds. Please wait.
id: Pembayaran Anda sedang diproses, bisa memakan waktu hingga {x} detik. Mohon tunggu.

# payment_proceeding_can_take_longer
source: Your payment is proceeding, it can take longer than usual due to busy traffic network. Please wait.
id: Pembayaran Anda sedang diproses, dapat memakan waktu lebih lama dari biasanya karena lalu lintas jaringan yang sibuk. Mohon tunggu.

source: Payment Completed
id: Pembayaran Selesai

# payment_completed_brought_back_3rdapp
source: Your payment completed successfully, you will be brought back to [3rd party app name] in {x} seconds
id: Pembayaran Anda berhasil diselesaikan, Anda akan dibawa kembali ke [3rd party app name] dalam {x} detik

# payment_completed_successfully
source: Your payment completed successfully.
id: Pembayaran Anda berhasil diselesaikan.

source: Payment Failed
id: Pembayaran Gagal

# payment_failed_brought_back_3rdapp
source: Your payment is failed, you will be brought back to [3rd party app name] in {x} seconds
id: Pembayaran Anda gagal, Anda akan dibawa kembali ke [nama aplikasi pihak ketiga] dalam {x} detik

# unfortunately_payment_failed
source: Unfortunately, your payment is failed.
id: Sayangnya, pembayaran Anda gagal.

# you_are_about_to_deposit
source: You are about to deposit amount of
id: Anda akan mendepostikan sejumlah

source: Go Home
id: Akses Beranda

source: Coming Soon
id: Segera Hadir

source: Please try again.
id: Silahkan coba lagi

# duration_of_approve_request
source: Duration of approve request process may take time. Please be patient and wait while itâ€™s being processed.
id: Durasi proses permintaan persetujuan mungkin membutuhkan waktu. Harap bersabar dan tunggu saat sedang diproses.

source: Approve Request
id: Permintaan Persetujuan

source: Failed to approve deposit
id: Gagal menyetujui deposit
